SubscriberRetrieveWithHistory.xml

<soapenv:Envelope xmlns:ccws="http://comverse-in.com/prepaid/ccws" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Header>
      <wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
         <wsse:UsernameToken wsu:Id="UsernameToken-10024647" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
            <wsse:Username>${username}</wsse:Username>
            <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">${password}</wsse:Password>
            <wsse:Nonce>BLRO7hSNNNwIaXKtE4OuBg==</wsse:Nonce>
            <wsu:Created>${created}</wsu:Created>
         </wsse:UsernameToken>
      </wsse:Security>
      <ccws:VersionInfoHeader></ccws:VersionInfoHeader>
   </soapenv:Header>
   <soapenv:Body>
      <ccws:RetrieveSubscriberWithIdentityWithHistoryForMultipleIdentities>
         <ccws:subscriberID>${MSISDN}</ccws:subscriberID>
         <ccws:informationToRetrieve>640</ccws:informationToRetrieve>
         <ccws:startDate>${startDate}</ccws:startDate>
         <ccws:endDate>${endDate}</ccws:endDate>
         <ccws:IsAllIdentity>false</ccws:IsAllIdentity>
      </ccws:RetrieveSubscriberWithIdentityWithHistoryForMultipleIdentities>
   </soapenv:Body>
</soapenv:Envelope>